/*! ********************************************************************************
 @file       BinaryFileDaoSpy.cpp
 @brief      BinaryFileDaoSpyクラスの実装ファイル
 @attention  なし
 **********************************************************************************/
//--------------< インクルードファイル >-----------------
#include "BinaryFileDaoSpy.h"

//--------------< ローカルなマクロの宣言 >-----------------

//--------------< ローカルな型／変数の宣言 >-----------------^

BinaryFileDaoSpy::BinaryFileDaoSpy() {

}

BinaryFileDaoSpy::~BinaryFileDaoSpy() {

}

