/*!*****************************************************************************
@file       IInputter.h
@brief      入力用DAOが実現すべきインターフェース
@attention  なし
*******************************************************************************/
#ifndef IINPUTTER_H_
#define IINPUTTER_H_

//----------< インクルード・ファイル >------------------------------------------
#include <string>

//----------< クラスの前方宣言 >------------------------------------------------

//----------< マクロの宣言 >----------------------------------------------------

//----------< 型の宣言 >--------------------------------------------------------

/*!*****************************************************************************
@class          IInputter
@brief          入力用DAOが実現すべきインターフェース
@note           入力用DAOが実現すべきインターフェースを規定する。
@attention      なし
@see            4.4.1
*******************************************************************************/
class IInputter {
public:
        IInputter(){};
        virtual ~IInputter(){};
        virtual void openInputter( std::string name ) = 0;
        virtual void closeInputter() = 0;
        virtual std::string readData() = 0;
        virtual bool isExist ( std::string name ) = 0;
};

#endif /* IINPUTTER_H_ */
