/*! ********************************************************************************
@file       IOutputter.h
@brief      出力用DAOが実現するインターフェース
@attention  なし
**********************************************************************************/
#ifndef IOUTPUTTER_H_
#define IOUTPUTTER_H_

//----------< インクルード・ファイル >------------------------------------------
#include <string>

//----------< クラスの前方宣言 >------------------------------------------------

//----------< マクロの宣言 >----------------------------------------------------

//----------< 型の宣言 >--------------------------------------------------------

/*!*****************************************************************************
@class			IOutputter
@brief			出力用DAOが実現するインターフェース
@note			出力用DAOが実現するインターフェースを規定する。
@attention		なし
@see          4.4.5
*******************************************************************************/
class IOutputter {
public:
    IOutputter(){};
    virtual ~IOutputter(){};
    virtual void openOutputDevice(std::string device) = 0;
    virtual void output(std::string& outputContents) = 0;
    virtual void writeContents() = 0;
};


#endif /* IOUTPUTTER_H_ */
