/*!*****************************************************************************
@file         TimeProvider.cpp
@brief			日付や時刻を提供
@attention    なし
*******************************************************************************/
//----------< インクルードファイル >--------------------------------------------
#include "TimeProvider.h"

//----------< ローカルなマクロの宣言 >------------------------------------------

//----------< ローカルな型／変数の宣言 >----------------------------------------

/*!*****************************************************************************
@brief          コンストラクタ
@note           クラスを構築する。
@param          なし
@return         なし
@attention      なし
*******************************************************************************/
TimeProvider::TimeProvider() {
}
/*!*****************************************************************************
@brief          コピーコンストラクタ
@note           クラスを複製する。
@param          theTimeProvider　コピー元のインスタンス
@return         なし
@attention      なし
*******************************************************************************/
TimeProvider::TimeProvider(const TimeProvider& theTimeProvider) {

}
/*!*****************************************************************************
@brief          代入演算子
@note           インスタンスの代入を行う。
@param          theTimeProvider　代入元のインスタンス
@return         this 自分自身のポインタ
@attention      なし
*******************************************************************************/
TimeProvider& TimeProvider::operator=(const TimeProvider& theTimeProvider)
{
    return *this;
}
/*!*****************************************************************************
@brief          デストラクタ
@note           クラスを破棄する。
@param          なし
@return         なし
@attention      なし
*******************************************************************************/
TimeProvider::~TimeProvider() {
}

/*!*****************************************************************************
@brief          現在日時を返す
@note           現在日時を、timespec構造体のフォーマットで返す。
@param          なし
@return         struct timespec 現在日時 [-] (-)
@attention      なし
*******************************************************************************/
struct timespec TimeProvider::GetCurrentDateTime() {
    struct timespec tm;

    clock_gettime(CLOCK_REALTIME, &tm);

    return tm;
}

